<?php

$language = [
	'error' => 'Ошибка',
	'login' => [
		1 => 'В поле Login/Email не допустимые символы',
		2 => 'Авторизация не была произведена. Возможно, Вы ввели неверный Login/Email или пароль.',

	],


	'registration' => [
		1 => 'Администратором сайта была отключена поддержка регистрации на сайте.',
		2 => 'На сайте уже зарегистрировано максимально допустимое количество пользователей. Попробуйте зарегистрироваться позже.',
		3 => 'Вы уже авторизованы на сайте под зарегистрированным аккаунтом.',
		4 => 'Недопустимая длина Login. Login не может быть менее 3 символов и более 40 символов!',
		5 => 'Вы используете недопустимый Login!',
		6 => 'Введён неверный Email адрес!',
		7 => 'Длина пароля должна быть не менее 8!',
		8 => 'Пользователь с таким Login или Email адресом уже зарегистрирован!',
		9 => 'Активация аккаунта',
		10 => 'Запрос на регистрацию принят. Администрация сайта требует реальности всех вводимых Email-адресов. Через 10 минут (возможно и раньше) Вы получите письмо с инструкциями для следующего шага. Ещё немного, и Вы будете зарегистрированы на сайте. Если в течении этого времени Вы не получили письма с подтверждением, то возможно, оно попало в папку со спамом. Пожалуйста, проверьте содержимое этой папки. В противном случае повторите попытку, используя другой e-mail адрес или обратитесь к администратору сайта.',
		11 => 'Ошибка активации аккаунта. Попробуйте заново.',

	],

	'relatesWord' => [
		'e' => '[eеё]', 'r' => '[rг]', 't' => '[tт]',
		'y' => '[yу]', 'u' => '[uи]', 'i' => '[i1l!]',
		'o' => '[oо0]', 'p' => '[pр]', 'a' => '[aа]',
		's' => '[s5]', 'w' => 'w', 'q' => 'q',
		'd' => 'd', 'f' => 'f', 'g' => '[gд]',
		'h' => '[hн]', 'j' => 'j', 'k' => '[kк]',
		'l' => '[l1i!]', 'z' => 'z', 'x' => '[xх%]',
		'c' => '[cс]', 'v' => '[vuи]', 'b' => '[bвь]',
		'n' => '[nпл]', 'm' => '[mм]', 'й' => '[йиu]',
		'ц' => 'ц', 'у' => '[уy]', 'е' => '[еeё]',
		'н' => '[нh]', 'г' => '[гr]', 'ш' => '[шwщ]',
		'щ' => '[щwш]', 'з' => '[з3э]', 'х' => '[хx%]',
		'ъ' => '[ъь]', 'ф' => 'ф', 'ы' => '(ы|ь[i1l!]?)',
		'в' => '[вb]', 'а' => '[аa]', 'п' => '[пn]',
		'р' => '[рp]', 'о' => '[оo0]', 'л' => '[лn]',
		'д' => 'д', 'ж' => 'ж', 'э' => '[э3з]',
		'я' => '[я]', 'ч' => '[ч4]', 'с' => '[сc]',
		'м' => '[мm]', 'и' => '[иuй]', 'т' => '[тt]',
		'ь' => '[ьb]', 'б' => '[б6]', 'ю' => '(ю|[!1il][oо0])',
		'ё' => '[ёеe]', '1' => '[1il!]', '2' => '2',
		'3' => '[3зэ]', '4' => '[4ч]', '5' => '[5s]',
		'6' => '[6б]', '7' => '7', '8' => '8', '9' => '9',
		'0' => '[0оo]', '_' => '_', '#' => '#', '%' => '[%x]',
		'^' => '[^~]', '(' => '[(]', ')' => '[)]', '=' => '=',
		'.' => '[.]', '-' => '-', '[' => '[\[]'

	],

];